using Discord;
using System.Threading.Tasks;

namespace ServitorDiscordBot
{
    public partial class ServitorBot
    {
        private async Task GetHelpAsync(IMessage message)
        {
            var builder = GetBuilder(MessagesEnum.Help, message);

            builder.Author = new();

            var g = (message.Channel as IGuildChannel).Guild;

            builder.Author.IconUrl = g.IconUrl;
            builder.Author.Name = $"На варті спільноти {g.Name} з 10.02.2021";

            builder.Description = $"Я **{_client.CurrentUser.Username}**, " +
                $"дружній прислужник, якого на околицях сонячної системи підібрав відважний ґардіан. " +
                $"Я не становлю загрози і присягаюсь служити на благо Останнього міста. " +
                $"Наразі Авангард надав мені роль обчислювальної машини у H.E.L.M. для збору статистичних даних про діяльність вашого [клану]({_clanUrl}).\n" +
                $"\n**Перелік доступних команд** *(для перегляду детальної довідки по команді введіть **допомога %команда%**)*:\n" +

                $"\n***біп*** - *запит на перевірку моєї працездатності*\n" +

                $"\n***тиждень*** - *переглянути інформацію про поточний тиждень*\n" +

                $"\n***сектори*** - *переглянути лутпул сьогоднішніх загублених секторів*\n" +

                $"\n***ресурси*** - *переглянути поточний асортимент вендорів*\n" +

                $"\n***зур*** - *переглянути інвентар Зура*\n" +

                $"\n***осіріс*** - *переглянути нагороди за випробування Осіріса*\n" +

                $"\n***еверверс*** - *переглянути поточний асортимент Тесс Еверіс*\n" +

                $"\n***еверверс %тиждень%*** - *переглянути асортимент Тесс Еверіс за визначений тиждень (1-15)*\n" +

                $"\n***мої активності*** - *кількість активностей ґардіана у цьому році*\n" +

                $"\n***мої побратими*** - *список побратимів ґардіана*\n" +

                $"\n***кланові активності*** - *кількість активностей клану в цьому році*\n" +

                $"\n***режими*** - *список типів активностей*\n" +

                $"\n***статистика клану %режим%*** - *агрегована статистика клану в типі активності*\n" +

                $"\n***дошка лідерів %режим%*** - *список лідерів у типі активності*\n" +

                $"\n***відступники*** - *виявити потенційно небезпечні активності окрім нальотів*\n" +

                $"\n***100K*** - *виявити потенційно небезпечні нальоти з сумою очок більше 100К*\n" +

                $"\n***реєстрація*** - *прив'язати акаунт Destiny 2 до профілю в Discord*";

            await message.Channel.SendMessageAsync(embed: builder.Build());
        }
    }
}
