using Discord;

namespace ServitorDiscordBot.BotCommands.TextCommands
{
    internal partial class ServiceCommandsManager
    {
        private Embed[] HelpEmbeds =>
            new Embed[]
            {
                new EmbedBuilder()
                    .WithColor(0xBE5BEF)
                    .WithTitle("Службові команди")
                    .WithDescription("**!donate** - підтримати розробника бота.\n")
                    .Build(),

                new EmbedBuilder()
                    .WithColor(0xBE5BEF)
                    .WithTitle("Рандом")
                    .WithDescription("Наявні 2 типи команд:\n" +
                            "**!random** ***N*** – генерує випадкове ціле число X в діапазоні 0 <= X < N.\n" +
                            "**!random** ***@Role*** – обирає випадкового користувача за вказаною роллю.")
                    .Build(),

                new EmbedBuilder()
                    .WithColor(0xBE5BEF)
                    .WithTitle("Видалення повідомлень")
                    .WithImageUrl("https://i.imgur.com/VYzsWPK.png")
                    .WithDescription("Видалення повідомлення можливе за прямим посиланням на повідомлення, або відповіддю на повідомлення.\n" +
                            "Видалення відповіддю на повідомлення здійснюється шляхом прописання відповідної команди у тексті відповіді.\n" +
                            "Якщо необхідно видалити за прямим посиланням, то замість відповіді необхідно дописати в кінці команди пряме посилання на повідомлення " +
                            "(видалення за прямим посиланням дозволяє видаляти повідомлення на іншому каналі сервера).\n" +
                            "\nНаявні 5 команд для видалення:\n" +
                            "**!delete_this** – видаляє вказане повідомлення.\n" +
                            "**!delete_after** ***count*** – масово видаляє вказану кількість повідомлень ПІСЛЯ вказаного повідомлення, " +
                            "можливе видалення лише тих повідомлень, які створені менше 2 тижнів тому.\n" +
                            "**!delete_slow_after** ***count*** – почергово видаляє вказану кількість повідомлень ПІСЛЯ вказаного повідомлення, " +
                            "якщо видаляється занадто велика кількість повідомлень, дискорд може обмежити можливість видалення на деякий час.\n" +
                            "**!delete_before** ***count*** – масово видаляє вказану кількість повідомлень ДО вказаного повідомлення, " +
                            "можливе видалення лише тих повідомлень, які створені менше 2 тижнів тому.\n" +
                            "**!delete_slow_before** ***count*** – почергово видаляє вказану кількість повідомлень ДО вказаного повідомлення, " +
                            "якщо видаляється занадто велика кількість повідомлень, дискорд може обмежити можливість видалення на деякий час.\n" +
                            "\nЯкщо задана кількість перевищує наявну кількість повідомлень у каналі, " +
                            "то буде видалено лише наявні повідомлення у заданому напрямку.\n" +
                            "Використовувати команду можуть лише власники серверів та користувачі з ролями \"administrator\", \"moderator\" або \"raid lead\".")
                    .Build()
            };
    }
}
